<template>
    <div class="article-container">
        <article class="company-article">
            <h1>{{ company.name }}</h1>
            <h3>{{ company.subtitle }}</h3>
            <p v-for="item in descriptionParagraphs">{{ item }}</p>
            <div class="signature mt-5">
                <i>Команда магазинчика</i>
            </div>
        </article>
    </div>
</template>

<script setup>
const company = {
    name: "E-shop.",
    subtitle: "Наш онлайн магазинчик",
    description:
        "Добро пожаловать в наш интернет-магазин электроники, где инновации встречаются с вашим стилем жизни! Мы гордимся тем, что предлагаем широкий ассортимент самых передовых и высокотехнологичных устройств для удовлетворения ваших потребностей в современном мире.\n" +
        "\n" +
        "Наш ассортимент включает в себя все, от смартфонов и ноутбуков до умных часов и гарнитур. Мы сотрудничаем с ведущими производителями электроники, чтобы предоставить вам доступ к последним технологическим достижениям. Вы можете быть уверены, что каждый продукт в нашем магазине соответствует высоким стандартам качества и надежности.\n" +
        "\n" +
        "Ознакомьтесь с нашим разнообразием смартфонов, предлагающих передовые камеры, мощные процессоры и инновационные функции. Наши ноутбуки обеспечивают высокую производительность и портативность для вашего комфорта. Умные часы и фитнес-трекеры помогут вам отслеживать свое здоровье и быть в курсе своих достижений.\n" +
        "\n" +
        "Мы также предлагаем разнообразные гаджеты для дома, начиная от интеллектуальных умных устройств для дома и заканчивая развлекательными гаджетами. У нас есть все необходимое, чтобы сделать ваш дом умным и современным местом для проживания.\n" +
        "\n" +
        "Магазин электроники не только о продуктах, но и об опыте покупки. Наша дружелюбная команда готова ответить на ваши вопросы и предоставить экспертные рекомендации. Мы ценим каждого клиента и стремимся обеспечить удовлетворительный опыт покупки.\n" +
        "\n" +
        "Приглашаем вас исследовать мир электроники вместе с нами. Будьте в центре технологических новинок и выбирайте только лучшие продукты для своей цифровой жизни. Сделайте свой выбор прямо сейчас в нашем интернет-магазине электроники и окунитесь в мир бескрайних возможностей!\n"
};

const descriptionParagraphs = company.description.split('\n')
</script>

<style scoped>
.article-container {
    display: flex;
    justify-content: center;
}

.company-article {
    text-align: center;
    max-width: 800px;
}

.company-article p {
    text-align: justify;
    text-indent: 30px;
}

.signature {
    margin-top: 50px;
    text-align: right;
}
</style>
